Revit 2027 API
ParameterTypeId.StairsTrisertypeRiserTreadConnection Property
 "Riser To Tread Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTrisertypeRiserTreadConnection { get; }
Public Shared ReadOnly Property StairsTrisertypeRiserTreadConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTrisertypeRiserTreadConnection {
	ForgeTypeId^ get ();
}
static member StairsTrisertypeRiserTreadConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace